# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

print("************")
# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

print("************")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

print("************")
# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
x = apples
banana = x * 4
# це задача з підвохом завдяки слову "завжди" ;) банальна відповіть banana = apples * 4 Роблю припущення що яблук тут завжди 2, відповідь виходячи з цього

print(f"Яблук: {apples}")
print(f"Бананів: {banana}")


print("************")
# task 05 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(f"Perimetery is {perimetery}")


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
print("************")

apple_tree = 4
print(f"Посаджено яблунь: {apple_tree}")
pear_tree = apple_tree + 5
print(f"Посаджено груш на 5 більше, тож додаємо ще 5: {pear_tree}")
plum_tree = apple_tree - 2
print(f"Посаджено слив на 2 менше (ніж яблунь), віднімаємо 2 та маємо: {plum_tree}")
result_in_garden = apple_tree + pear_tree + plum_tree
print(f"Сумуємо три поміжні результати та маємо загальну кількість дерев в саду: {result_in_garden}")

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
print("************")

until_noon_temperature = 5
print(f"Температура до обіду була на 5 градусів вище за 0, тобто це 0 + 5, маємо: {until_noon_temperature}")
afternoon_temperature = until_noon_temperature - 10
print(f"Далі температура опустилася на 10 градусів, тож ми віднімаємо з попередньої температури 10, та маємо: {afternoon_temperature}")
evening_temperature = afternoon_temperature + 4
print(f"Увечері потепліто на 4 градуси, тож додаємо до післяобіднього результату 4, та маємо вечірню температуру: {evening_temperature}")

print("************")
# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys = 24
print(f"Хлопчиків: {boys}")
girls = int(boys / 2)
print(f"Дічат вдвічі менше, тож ділемо кількість хлопців на 2, та маємо: {girls}")
children_all = boys + girls
print(f"Додаємо кількість хлопців до кількості дівчат та маємо загальну кількість дітей у гуртку: {children_all}")
children_today = children_all - 3
print(f"Сьогодні немає 1 хлопчика та 2-х дівчат (сумуємо), тож разом немає 3-х дітей. Далі віднімаємо від загальної кількості дітей які є в гуртку, цих трьох та маємо: {children_today}")

print("************")


# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
print("Спочатку треба з'ясувати скільки коштує кожний примірник 3-х з книг. Примірник, це 1 шт.")
book1 = 8
print(f"Примірник першої книги: {book1} грн")
book2 = book1 + 2
print(f"Примірник другої книги, на 2 дорожче, тож додаємо до вартості першої 2: {book2} грн")
book3 = int((book1 + book2) / 2)
print(f"Щоб дізнатися скільки коштує примірник третьої книги, треба спочатку додати ціну першох до другої, а далі, щоб побачити половину вартості перших двох разом, розлілити їх на 2. Результат: {book3} грн")
print("Тепер знаючи скільки коштує кожен примірник окремо, можемо рахувати фінальний результат")
result = book1 + book2 + book3
print(f"Сумуємо ціни за примірник 1-ї, 2-ї, та 3-ї книги відповідно треба: {result} грн, щоб купити 3 книги")